{
	"entries":[
        
        {
		"date":"6/1/2015",
		"title":"First day of class",
		"text":"Tools used today:<br>Drop-Box -- Cloud storage for our programs and future work.<br>Portal.Microsoft.com -- All your typical MS programs. Word, Excel, Outlook.<br>MS Dreaksparks -- A copy of each of the MS programs. Like Winidows 7/8/10, Office, XNA, etc.<br>Stack Overflow.com -- Good source for Programming Q/A<br>Git Hub -- Source control location with cloud repositories<br>Notepad++ -- Programming editor. Uses a nice set of syntax coloring options for many languages.<br><br><br><br>Lab 1: Twitter Spam Bot Project Set-up:<br>Dev account<br>-Dev.twitter.com<br>-Standard user login (note, Need a valid email address and valid phone number - More on this Later)<br>-Bottom of the dev page is a button called \"Manage Applications\"<br>-Create Applications<br><br>Python/Twitter API - Tweepy:<br>New Command for me: PIP install Tweepy<br>I don't know much about the command yet but it ends up working a bit like Linux's Apt-Get repositories. I'm not sure if it functions exactly the same, but it has a simlar feel.<br><br>Twitter requires security keys before it will let a program post to the twitter account. These keys can be stored directly in the file, but if you put it on a public source control like Git Hub, people can skim these numbers.<br>A better solution is to put it in a separate python file, import it like any other import, and use a dictionary for the key look-up. Then DO NOT REVISION CONTROL this file. DON'T DO IT. Add it to git's ignore list. If you need to, but a blank key file into the repository so that anyone that forks it can understand how it works.<br><br>New Commands:<br>fileVar = open('filename.txt','r') # Opens as Read only. Locks the file so that new addition while the program are running, are not added.<br>fileVar.Close # Closes and releases the file for R/W again.<br>s = api.update_status(status = m, in_reply_to_statusid = tweet.id)<br><br><br><br>Lab 2: Git Set-up:<br>I think I finally have my head wrapped around it.<br>Best results I got from Building the Repo in Git-Hub first. Then CLONE/PULL the repo from Git-Hub, and it should load onto the the machine. Source Tree seemed to work the best for me. when I cloned it, it asked me where to save it.<br> <br> Each project should be it's own repository.<br> You should commit anytime you have solved a problem or come up with a good piece. You probably should not commit when something isn't working. Solve one problem. Commit, solve the next, commit, etc.<br> In collaboration with others, when you try to merge the files from two different users, it seems to work well - but sometimes you may have to manually edit and sort through it.<br> <br> Recommended procedure to try to prevent errors: 1. Commit my changes locally. 2. Pull Repository from the rest of the collective repository for everyone elses changes. 3. Push final changes up to the group repository.<br> <br> Git ignore file is a list of file extensions and specific files that Git will ignore during the commit/push process (like the twitter key example).<br> <br> New git command line Commands:<br> git init - starts the repository<br> git add <filename.txt> - adds a file to repository<br> git status - self explanatory<br> git log - shows previous commits<br> git commit -m \"Comment\" - commits with a recorded message<br> git remote add origin <\"https:\\ github repository\"> - Not sure. I think this one adds files to the git-hub repository, or else creates the git-hub repository<br> git push -u origin master - Pushes the repository to git-hub, -u remembers it as the default<br> git pull origin master - pulls the git-hub repository to local<br> git diff HEAD - checks the differences between the repository and staged, -HEAD shows the most recent commit. Seems to need to be capitalized<br> git diff --staged - shows changes in the staged area<br> git reset filename - rolls back a staged file<br> git checkout -- filename - recheckouts a file, overwriting the \"in-progress version\" (I think)<br> git branch <branch name> - creates a branch<br> git branch - shows existing branches<br> git checkout <branch name> - makes the other branch the active branch<br> git rm '*.txt' - deletes all the txt files (seems to follow linux commands)<br> git merge <branch name> - merges the branch into the active branch<br> git branch -d <branch name> - deletes a branch<br>"
        },
        {
        "date":"6/2/2015",
		"title":"Programming Basics",
        "text":"New Tools we used today:<br>- iPython Notebook -- we use this to open up our labs and lessons for the day<br>- Notepad ++ -- Remember, change the Save-As file type to .py not default .txt<br>Book Sources:<br>- www.pythonlearn.com/book -- Community Commons licensed (free use, with acknowledgement) text book from UMichigan.<br>Best Practices:<br>- Print statements preferred to use the ()<br>- Also prefers to use Double Quote (\") over single quote.<br>- Obviously use comments, but you should code in such a way that you can tell whats going on, just by reading the code. Use MNemonic naming (ie. FirstNameofUser)<br>- Even if an equation doesnt need parenthesis, it is recommended that you put them in the way you want it processed, to clarify the code.<br>Discoveries:<br>- Lists have an automatic sort function list.sort(). <br>- it phisically modifies the list, rather than providin an output. So:<br>- print list.sort() returns None<br>* the correct form is:<br>- list.sort()<br>- print list<br>*NOTE: We did some testing today,<br>- Q: When does Python recognize when it needs to Float during an arithmetic operation? - A: As soon as it runs across a float: So...<br>- 4 / 5 - 5.0 = -5 (4/5 is integer match and truncates to 0)<br>- 4.0 / 5 - 5 = -.2 (because it converst it right away to float in the first operation)<br>*NOTE: I ran across this -- according to this website,<br>(http://www.mathcs.emory.edu/~valerie/courses/fall10/155/resources/op_precedence.html)<br>- when doing boolean logic, == comes before and/or<br>- so True and 1 == 0 is equivalent to [True and (1==0)].<br>- also And takes priority over Or<br>- So True and False or False is equivalent to [(True and False) or False]<br>New Concepts discussed today:<br>Variables:<br>- Variable name must start with a letter or underscore<br>- may also contain numbers, but cannot start with a number<br>- Remember that they are always case sensitive: Apple != apple<br>Assignments and expressions:<br>- x = 2 is an assignment because it just just a constant 2<br>- x = x+2 is an assignment with an expression<br>Some odd/new operators:<br>- ** Python uses the double (*) for exponents<br>- % Python uses the % for modulus (remainder after division)<br>BEMA = Order of Operations is Brackets, Exponents, Multiplication (and division), Addition (and subtraction), Left to Right<br>New commands:<br>- type(variable) - return the variable type (ie. int, str, etc.)<br>- type casting - forcing the variable into another type. (ie. intVar = int(floatVar)) <br>-float(var)<br>-int(var)<br>-str(var)<br>- Note, if you try to cast something that can't be done, it will crash (see Try: Except:)<br>- answer = raw_input(\"Prompt\") - Prompt the user for input from the keyboard<br>Try/Catch (except in python):<br>- try: - Surround a block of dangers code with a try block. If an error occurs, it will run the Except instead.<br>- except: - this would be the block that gets run if it fails<br>- if an error occurs, the try: block will still be run, up until the point where it actually fails. <br>- In otherwords, it doesn't pre-process the try block. it runs like normal until it hits the error, and then runs the except block from there.<br>- In most other languagess, it is called Try:/Catch:<br>Conditional Execution:<br>- Remember \"==\" (double equal) is the if statement. \"=\" (single equal) is the assignment<br>- != is not equal<br>- if (condition test):<br>- everything in that if-block is indented after the the colon (:)<br>- remember its elif NOT ElseIf<br>- if: elif: else:"}
        
        
        
        
	]
}