{"entries":[
{"date":"06/1/2015", "title":"First day of class", "text":"Tools used today:<br>Drop-Box -- Cloud storage for our programs and future work.<br>Portal.Microsoft.com -- All your typical MS programs. Word, Excel, Outlook.<br>MS Dreamsparks -- A copy of each of the MS programs. Like Winidows 7/8/10, Office, XNA, etc.<br>Stack Overflow.com -- Good source for Programming Q/A.<br>Git Hub -- Source control location with cloud repositories.<br>Notepad++ -- Programming editor. Uses a nice set of syntax coloring options for many languages.<br><br><br>Lab 1: Twitter Spam Bot Project Set-up:<br>To create a twitter development account<br>-Dev.twitter.com<br>-Standard user login (note: Need a valid email address and valid phone number on creation. Google Voice will work for this.)<br>-At the bottom of the dev page is a link called Manage Applications<br>-Create a new applications to get your authorization keys<br><br>Python/Twitter API - Tweepy:<br>New Command for me: PIP install Tweepy<br>I don't know much about the command yet but it ends up working a bit like Linux's Apt-Get repositories. I'm not sure if it functions exactly the same, but it has a simlar feel.<br><br>Twitter requires security keys before it will let a program post to the twitter account. These keys can be stored directly in the file, but if you put it on a public source control like Git Hub, people can skim these numbers.<br>A better solution is to put it in a separate python file, import it like any other import, and use a dictionary for the key look-up. Then DO NOT REVISION CONTROL this file. DON'T DO IT. Add it to git's ignore list. If you need to, but a blank key file into the repository so that anyone that forks it can understand how it works.<br><br>New Commands:<br>fileVar = open('filename.txt','r') # Opens as Read only. Locks the file so that new addition while the program are running, are not added.<br>fileVar.Close # Closes and releases the file for R/W again.<br>s = api.update_status(status = m, in_reply_to_statusid = tweet.id)<br><br><br><br>Lab 2: Git Set-up:<br>I think I finally have my head wrapped around it.<br>Best results I got from Building the Repo in Git-Hub first. Then CLONE/PULL the repo from Git-Hub, and it should load onto the the machine. Source Tree seemed to work the best for me. when I cloned it, it asked me where to save it.<br> <br> Each project should be it's own repository.<br> You should commit anytime you have solved a problem or come up with a good piece. You probably should not commit when something isn't working. Solve one problem. Commit, solve the next, commit, etc.<br> In collaboration with others, when you try to merge the files from two different users, it seems to work well - but sometimes you may have to manually edit and sort through it.<br> <br> Recommended procedure to try to prevent errors: 1. Commit my changes locally. 2. Pull Repository from the rest of the collective repository for everyone elses changes. 3. Push final changes up to the group repository.<br> <br> Git ignore file is a list of file extensions and specific files that Git will ignore during the commit/push process (like the twitter key example).<br> <br> New git command line Commands:<br> git init - starts the repository<br> git add filename.txt - adds a file to repository<br> git status - self explanatory<br> git log - shows previous commits<br> git commit -m Comment - commits with a recorded message<br> git remote add origin github-repository - Not sure. I think this one adds files to the git-hub repository, or else creates the git-hub repository<br> git push -u origin master - Pushes the repository to git-hub, -u remembers it as the default<br> git pull origin master - pulls the git-hub repository to local<br> git diff HEAD - checks the differences between the repository and staged, -HEAD shows the most recent commit. Seems to need to be capitalized<br> git diff --staged - shows changes in the staged area<br> git reset filename - rolls back a staged file<br> git checkout -- filename - recheckouts a file, overwriting the in-progress version (I think)<br> git branch branch-name - creates a branch<br> git branch - shows existing branches<br> git checkout branch-name - makes the other branch the active branch<br> git rm '*.txt' - deletes all the txt files (seems to follow linux commands)<br> git merge branch-name - merges the branch into the active branch<br> git branch -d branch-name - deletes a branch<br>"},
{"date":"06/2/2015", "title":"Programming Basics", "text":"New Tools we used today:<br>- iPython Notebook -- we use this to open up our labs and lessons for the day<br>- Notepad ++ -- Remember, change the Save-As file type to .py not default .txt<br><br>Book Sources:<br>- www.pythonlearn.com/book -- Community Commons licensed (free use, with acknowledgement) text book from UMichigan.<br><br>Best Practices:<br>- Print statements preferred to use the open/close parenthesis()<br>- Also prefers to use double quote over single quote.<br>- Obviously use comments, but you should code in such a way that you can tell whats going on, just by reading the code. Use MNemonic naming (ie. FirstNameofUser)<br>- Even if an equation doesnt need parenthesis, it is recommended that you put them in the way you want it processed, to clarify the code.<br><br>Discoveries:<br>- Lists have an automatic sort function list.sort(). <br>- it phisically modifies the list, rather than providing an output. So:<br>- print list.sort() returns None<br>* the correct form is:<br>- list.sort()<br>- print list<br><br>We did some testing today,<br>- Q: When does Python recognize when it needs to Float during an arithmetic operation? - A: As soon as it runs across a float: So...<br>- 4 / 5 - 5.0 = -5 (4/5 is integer match and truncates to 0)<br>- 4.0 / 5 - 5 = -.2 (because it converst it right away to float in the first operation)<br><br>I ran across this -- according to this website,<br>(http://www.mathcs.emory.edu/~valerie/courses/fall10/155/resources/op_precedence.html)<br>- when doing boolean logic, == comes before and/or<br>- so True and 1 == 0 is equivalent to [True and (1==0)].<br>- also And takes priority over Or<br>- So True and False or False is equivalent to [(True and False) or False]<br><br>New Concepts discussed today:<br>Variables:<br>- Variable name must start with a letter or underscore<br>- may also contain numbers, but cannot start with a number<br>- Remember that they are always case sensitive: Apple != apple<br><br>Assignments and expressions:<br>- x = 2 is an assignment because it just just a constant 2<br>- x = x+2 is an assignment with an expression<br><br>Some new operators:<br>- ** Python uses the double (*) for exponents<br>- (percent sign) Python uses the percent sign for modulus (remainder after division)<br>BEMA = Order of Operations is Brackets, Exponents, Multiplication (and division), Addition (and subtraction), Left to Right<br><br>New commands:<br>- type(variable) - return the variable type (ie. int, str, etc.)<br>- type casting - forcing the variable into another type. (ie. intVar = int(floatVar)) <br>-float(var)<br>-int(var)<br>-str(var)<br>- Note, if you try to cast something that can't be done, it will crash (see Try: Except:)<br>- answer = raw_input(Prompt) - Prompt the user for input from the keyboard<br>Try/Catch (except in python):<br>- try: - Surround a block of dangers code with a try block. If an error occurs, it will run the Except instead.<br>- except: - this would be the block that gets run if it fails<br>- if an error occurs, the try: block will still be run, up until the point where it actually fails. <br>- In otherwords, it doesn't pre-process the try block. it runs like normal until it hits the error, and then runs the except block from there.<br>- In most other languagess, it is called Try:/Catch:<br><br>Conditional Execution:<br>- Remember == (double equal) is the if statement. = (single equal) is the assignment<br>- != is not equal<br>- if (condition test):<br>- everything in that if-block is indented after the the colon (:)<br>- remember its elif NOT ElseIf<br>- if: elif: else:"},
{"date":"06/3/2015", "title":"Python Projects", "text":"I worked on 3 main projects today. <br>1. Personal Project -- My first, built completely from scratch AI.(https://github.com/mkohlmann-he/AI_Test)<br>2. Previous exercise -- took my existing code and did some pre-filtering so that it doesn't crash if someone enters invalid data<br>3. New exercise -- Dice Wars!! (https://github.com/mkohlmann-he/DiceGame)<br><br>Personal Project (AI)<br>- - - - - - - - -<br>Discoveries:<br>file.readlines()<br>- There are several commands that read files. <br>- For the data structure I have in mind, I chose the readlines() command. (note the s, plural, that threw me for a loop for a while)<br>- It basically takes the file and converts it line by line into a list.<br>line.strip()<br>- Using the readlines(), unfortunately it leaves the newline character at the end of each line, so I had to look up how to strip it.<br>- The command doesn't work well with HTML, so showing it in this blog is screwing everything up... but you can find it here: http://stackoverflow.com/a/15233379 <br>- I still don't understand how it works, but I am trying to figure it out.<br>- to me, it almost seems like its a loop within brackets. Kind of a one-liner.<br>Completed:<br>1. Open file<br>2. Read file, and parse into a list, with knowledge base association per item<br>3. Loop through each association and parse into <br><br>Previous Exercise (PayCheck Calculator)<br>- - - - - - - - - <br>Discoveries:<br>while not Valid<br>- I searched google for a while on how to properly handle these. This strategy was the only one that I really understood.<br>- Basically it consists of a while loop is a flag pre-set to False:<br>- Then it asks the user for input<br>- Using ifs, it checks the entry to make sure it's valid (ie. .isdigit(), isn't None, etc.)<br>- If it fails, it's graceful enough to spit out an error message, and then the while loop asks for input again.<br>- If it passes, it sets the flag to True, and continues on, out of the loop.<br><br>New Exercise (Dice Game)<br>- - - - - - - - - <br>- I have a lot of the preliminary structure working.<br>- Storing my player info in a multi-dimentional list<br>- Storing my remaining available dice in a list-item within the list.<br>- The initialization of game (get player info, number of rounds, etc) is complete<br>- Next step, working on player selection of the dice, rolling the dice, and comparing for win/loss.<br>"},
{"date":"06/4/2015", "title":"Looping and String Ops", "text":"Today we had two lectures, and worked on our Dice War game project.<br><br>Lectures were:<br>1. Looping<br> - while <condition> : will continue to run and repeat while the condition is True<br>- break -- kicks you out of the loop, does not continue any more code in the loop and places you one line after the END of the loop<br>- continue -- restarts the loop, does not continue any more code, and places you and the START of the loop to run again<br><br>- for var in list/string/array or objects:<br>- var is actually an assignment, the for loop pulls each item out of the list, assigns it to var, then processes it.<br><br>- for <var> in range(start,stop):<br>- start/stop can be numbers, letters, or any series<br><br>- for var in [a, x, y, 2, 24]<br>- the for loop will process each item in the list<br><br>2. String Ops<br>- covered some really interesting string ops like slicing String[start:stop], Strip (strip left side, right side, both), find, replace, etc.<br>- I won't cover them all, you can look them up pretty easy online. <br><br>Dice War Game:<br>- Added Scoring<br>- Added Tie-score decisions<br>- Added Turn control<br>- Added Full round control and scoring<br>- Added nice score board<br>- Added multiple players<br>- Added 3 bots (count up, count down, count random)<br><br>ToDo: Maybe add the ability to detect if all the players are bots (simulations) and ignore waiting for player inputs and delays set to 0.<br>"},
{"date":"06/5/2015", "title":"DICE WARS!!", "text":"Today I finished my dice game. Fixed up some UI to make it look neat and polished (as polished as you can get with a command line game). I also added a simulation mode. It detects if all the players are bots, and if so, it will ignore any time delays and user input delays between rounds (so it just keeps looping through selection, roll, and scoring, until the end of game and just shows the end results).<br><br>Bug Fixes:<br>At the end of the round, if two players had the same score, it failed. It now makes them do a roll-off. Each of the tied players rolls a d20 and whoever wins gets the final point.<br><br><br>We also had a lecture on tips for google searching technical terms:<br> 1. Putting words in quotes (\"), google will look for the exact phrase.<br> 2. search terms site:url will search a specific site for the terms<br> 3. -keyword will exclude entries that contain the keyword<br> 4. +keyword will be identical to using the double quotes<br> 5. Asterics (*) is a wildcard, so \"happy * day\" would might find, birthday, or mothers day, etc.<br> 6. inurl:\"terms\" will find urls with the keywords in it.<br><br>google.com/landing/searchtips will give more tips<br>google doesnt really do boolean searches so AND/OR/NOT doesn't really work."},
{"date":"06/8/2015", "title":"Objects", "text":"What is an Object? It can represent anything. A person, place, bank account, table...<br>It has Attributes or fields that store data.<br>It has Methods or functions that manipulate the data and do things.<br><br>Classes are like the imaginary prototype of the object. Human for example.<br>Then you instantiate the object as the individual. Bob = Human() for example.<br><br>The constructor: __init__() defines how it is created.<br>Inside the class, the self.whatever() reference is used as a way to reference the individual, rather than the class.<br><br>Attributes should should be private, within the class, and not accessible directly from outside the class.<br>Get-Set methods will allow you to access these attributes.<br>For example: <br>- andrew.fullname = \"Andrew Jones\" is wrong<br>- andrew.setFullName(\"Andrew Jones\") would be more appropriate.<br><br>You can store data within the class, that reference the entire class. <br>ie. __studentCount (not self._studentCount) might be used as a way to save processing time from iterating through all the students, just to get the count.<br><br>Note: Most methods have an implied self in the call.<br>ie. def get_age(self), but when you call it, it's only andrew.get_age() (note, no self between the brackets)<br><br>Encapsulation:<br>Black Box programming. You know what goes in, and what you expect to get back, but you don't need to know what happens within the object.<br><br>Inheritance:<br>A class can inherit attributes from a parent class.<br>ie. <br>class Animal:<br>class Cat(Animal):<br>class Dog(Animal):<br><br>Polymorphism:<br>A class can elegantly cope with different types of inputs. Like internally converting an int to a string, etc.<br><br><br>Best Practices:<br>Capitalize the name of the class.<br>Don't pluralize the name of the class. Keep it an individual.<br>you can inherit from more than one source but DO NOT DO IT! Bad practice. Can cause many errors.<br><br><br>And we have a new project. This one is also a game. It has 4 everyday objects, that fight. We have a granola bar, a notebook, a backpack and a computer. Fight to the DEATH!"},
{"date":"06/9/2015", "title":"Binary", "text":"Binary basics:<br>We as humans count in base 10 (most likely because we have 10 fingers). What is excellent about base 10, is every digit is and additional power of 10. So 10^0=1, 10^1=10, 10^2=100, 10^3=1000, etc.<br><br>Computers can only think in 1's and 0's, so it uses binary, and Base 2. Everything is in the power of 2s, so, 2^0=1, 2^1=2, 2^3=4, 2^4=8, then 16, 32, 63, 128etc., the standard memory increments you see in computing.<br><br>To convert the binary to decimal, add up it's 2's component (remember LSB is on the right, MSB is on the left). So 11000101 = (128 + 64 + 4 + 1) or 197<br>Converting backwards, take the 2's component that best fits:<br>So, lets say starting number = 88:<br>88-64 leaves 24<br>24-16 leaves 8<br>8 - 8 leaves 0 and your done.<br>The binary equivalent would be 1011000.<br>(This would be a lot clearer if I knew how to format grids in HTML already. Maybe I'll come back to it when we cover that.)<br><br>0 = bit (b)<br>0000 = nibble<br>0000 0000 = byte (B)<br>1024 bytes = 1 kilobyte (kB)<br>1024 kilobytes = 1 megabyte (MB)<br>1024 MB = 1 gigabyte (GB)<br>Following this parttern, the next steps are:<br>Terrabyte (TB), or 1 million, million bytes<br>Petabyte<br>Exabyte<br>Zetabyte<br>Yottabyte<br><br>Internet terminology:<br>Note: Most carriers actually advertise in mega BITS per second. Not Bytes<br><br>Latency: the amount of time it takes for a bit to travel from point A to point B<br><br>Bandwidth: how many bits per second you can transfer<br><br>The difference is best described as a country road from Milwaukee, to Chicago. The latency is 2 hours, and you can get 1 car per second.<br><br>If you change it to a free-way, your latency is still 2 hours, but you can fit 2 or 3 cars side-by-side, so your bandwidth increaes.<br><br>The only way to change the latency would be to find a short cut between Milwaukee and Chicago.<br><br><br><br>Also, continued on the OhSHIT game we are developing as a team.<br>A couple of insights I had today:<br>1. To help with collisions one good strategy is to break the project into parts and files. Each person can work in their own file, and the main program can import them.<br>2. A good strategy for Git-Hub in multi-user is to first pull any changes from the shared repository. Check for conflicts, commit your changes back to your private git, then send out the pull request.<br>3. A helper macro within Git is -git remote add Short_Cut_Name Shared_Repository_URL<br>4. With that you can do -git pull ShortCut master, to quickly pull the master git off the shared repository.<br>"},
{"date":"06/10/2015", "title":"Personal Projects", "text":"Personal Projects:<br>------------------<br>We finished our OhSHIT game today after some debugging, and group test-play. There is still a lot of polish that can be done to the UI, but as an engine, it is working properly as we expect. Professors have called it complete. I may revisit it later, if I have time, to polish it up for a portfolio project.<br><br>In the afternoon, we started new personal projects of our choice. We have roughly 24 hours to finish it. Details of my project below.<br><br>Time Tracker:<br>1. This will be a desktop widgit, possibly with a pin to keep it in front of other applications.<br><br>2. It's purpose is to allow the user to quickly log what projects they work on through out the day, and what tasks.<br><br>3. It contains a simple interface, select a project, give it a task comment (ie. working of file sharing function), Push the start button.<br><br>4. In the back ground, the timer starts up. If the user wants to pause the timer (ie. coffee break), it will stop the timer, and start it back up when they return.<br><br>5. At the end of the task, or whenever they want to change the comment, they can push the Stop button, at which point it will finalize the cumulative time, and log the entry into a tab delimited text file (tab was chosen, on the off chance the user enters comments with commas in them).<br><br>Today, I completed the main data entry class, and logging of the entries into the text file. Works well. I think this is actually doable in the 24 hours (though I still have to research the GUI). Going through the wxPython library tutorial this afternoon. Tomorrow morning, I will try to implement it with my project.<br>"},
{"date":"06/11/2015", "title":"Personal Projects", "text":"Personal Projects:<br>------------------<br>Pretty Straightforward day. Finished up the personal project, and finishing up the functionality and GUI. The GUI itself was quite a learning process. The GUI page became my Main Loop, because as part of the GUI, it becomes an Event Handler. It continuously loops, looking for events then triggers functions or other methods.<br><br>With that worked out, I imported my Data Entry class that I worked on yesterday, and had it trigger the stop-watch start/stop/pause functions, and the export to text file functions.<br><br> I consider iteration 1 complete. I am now doing some self-study on connecting python to Databases. The instructors think that MySQL is a good solution, and my own research tends to agree with that.<br><br> I found some tutorials online and said a very common tool-chain for webservers is LAMP (Linux, Apache, MySQL, and PHP). I think if I start down this path, it can only help me in the future. If I decide to change DB packages later, the work I put into MySQL will still be relevant."},
{"date":"06/12/2015", "title":"Lemonade Stand", "text":"Coding Challenge:<br>------------------<br>Today, I worked more on my personal project, adding some more MySQL database functionality. I was able to get it connect, Save, and read entries. In the afternoon we worked on a coding challenge. We have until the end of the day to completely write the game Lemonade Stand from scratch. If we don't finish we have homework, we have to finish the program and present it on Monday Morning. So far, it's not looking good..."},
{"date":"06/15/2015", "title":"Pygame", "text":"Pygame Library:<br>------------------<br>I did pretty good over the weekend. I was the only one to completely finish the Lemonade Stand coding challenge. It took me most of Saturday, but still, did better than anyone else.<br><br>Today we have a new challenge. One student becomes the project manager. Together we work as a team to build a clone of the Asteroids game.<br><br>We are using the pygame library to quickly develop our user interface. It is surprising how quick and simple it is to develop with it. Of course, at it's base, Asteroids is a pretty simple game. During the first hour or two of our research time I was able to read keyboard inputs, and control the bouncing motion of a ball on the screen, print a high score, etc.<br><br>Really pretty amazing stuff.<br><br>For the project, my assignment is the main game engine design. Others are in charge of the graphics engine, and the classes for the asteroids and space ship. For my part, its actually pretty easy. Read the inputs, signal the ship and asteroids to increment their motion, and send everything to the graphics engine for display."},
{"date":"06/16/2015", "title":"Agile Workflow", "text":"Pygame:<br>------------------<br>Today we continued on our Asteroids clone. We integrated the Ship class file, and the Graphics engine into it. I worked on adding the Shoot the Laser! functionality by creating a bullet class. It gets processed like any other object, though the graphics engine. I also added the functionality that when the bullet moves off screen it gets removed from the object list, to save memory and processing time.<br><br>On a side note: after doing more research on pygame sprites there is a lot of functionality prebuilt into the sprite class. If I would have known that, I think I would have designed the main engine differently in order to utilize these pre-built functions (collision detection, display, time increment updating for motion... lots of stuff that I designed into the engine from scratch).<br><br><br>Agile Workflow:<br>------------------<br>Today we also had a lecture on Agile workflow, covering first the Waterfall workflow, and moving how it differs from Agile. Multiple, but shorter, design cycles with a small set of features for the customer to test after each sprint. We discussed the general topics of 'Story Time', 'Kickoff', 'Development', 'Retrospective', and the daily scrums. We discussed the general topics of 'Epics', 'Themes', and 'Tasks' with regards to the 'User Stories'. Finally, we talked about the Agile Triangle, and who is responsible for the 'Value to Customer', 'Quality of Product', and 'Constraints'. Overall, I think it was a pretty excellent crash course in Agile. I have heard the term several times before, but I wasn't really aware of what was all involved. It's one of those catch-phrases you hear, that everyone talks about, but has a slightly different variation of how it's implemented."},
{"date":"06/17/2015", "title":"Better Git Hub Management", "text":"GitHub-SourceTree:<br>------------------<br>Today started out EXTREMELY frustrating. We had some major problems with our revision management strategy. Somehow, one of us, and we aren't sure who, overwrote some files, and we lost quite a bit of work. We also got into a bit of a corrupted Git repository problem where I couldn't commit because I couldn't pull, and I couldn't pull, because it was stuck in a commit. Eventually I had to blow out my entire local repository and pull from the main group repository again.<br><br>In the end one of our instructors showed us a MUUUUCH better method of using a group repository in Source Tree. We all become contributors to the one group repository and push and pull individual files, rather than have a single repository administrator that has to worry about all the different merges. It worked, WAY better. I feel so much more relaxed than my stressed out state this morning.<br><br>By the end of the day, we rebuilt everything we lost and advanced even further. The asteroid class is finally finished and inserted into the game. Bullets are added in, and we have collision detection with the bullets and asteroids and they properly pop out of existence. Tomorrow my goal is to work on the end of game conditions, while the other guys work on scoring, and the ship crashing into the asteroid, and loosing lives. For such a crappy start, the ending was fantastic."},
{"date":"06/18/2015", "title":"Asteroids continued", "text":"Adding more functionality:<br>------------------<br>Today was another good day. We added a lot of functionality to the game. I added an explosions class, which is just a object to show the explosion animation. It takes a time, frame-rate, and number of images in your animation and splits the images up evenly across the play-time. Also added the end of game functionality, with displaying the high scores. We made it a little fancy, so that in the background, the asteroids keep flying around, as if the game were still playing. This took some work to modify the controls, and screen, to ignore the player inputs for 2 seconds. After 2 seconds, any keyboard press will dump you back to the starting splash screen.<br><br>By the afternoon, we had a fully working game worthy of being a completed game. We discussed and took on several ad-on options and had about 24 hours to complete. Tomorrow we are done with Python and move onto Javascript.<br><br>The add-ons we took on were an options screen, and player powerups. We took an extra life power-up, a Bullet powerup, and a shield powerup. We will see if we can finish in time..."},
{"date":"06/19/2015", "title":"Asteroids continued(2)", "text":"Power-ups and field trips:<br>------------------<br>We finished our game completely by noon, with just minutes to spare. We had to modify the bullet class, and ship class to take on the added functionality. Also, the display functions and the main game engine had to me modified to accomodate the graphics changes and to spawn the larger wave-like bullets.<br><br>This afternooon we visited PKWARE who are probably most famous for creating PK-Zip which is our modern Zip files of today. Their new projects are focused on client side encryption, so that you can take a file, and encrypt it, then harmlessly push that file anywhere, say to drop-box or anywhere. If the file is intercepted in transit or stolen from a server, it is still safe and secure. Really interesting stuff. It seemed like a pretty cool work envirnment as well, with an open concept, sit/stand adjustable desks, and ping-pong/pool table in the break room. I know not all offices are this way, but I wouldn't mind working in a place like that. It would be a nice change from my old cubicles."},
{"date":"06/22/2015", "title":"Javascript", "text":"Quarter mark:<br>------------------<br>Good lord, we are a quarter of the way done already.<br><br>Today starts new topics. Python is done, and Web front-end is king of the realm.<br><br>HTML: Hypertext markup language. By itself is pretty straight forward. It is basically the content (minus the style) of what a web page looks like. If you wanted to, you could embed the sheet style codes directly into the HTML, but it would look very cluttered. It uses tag, like P, BODY, and HEAD to define portions of the screen.<br><br>CSS: Cascading Sheet Style. Controls the style of the page. How objects look. It's called cascading because you have the option of overwriting the default styles at a lower level. (ie. Main Page, to Body, to Table, to Row... at anypoint, you can overwrite the higher order level.) CSS would cover things like color, cell spacing, borders, etc.<br><br>Javascript: This is the logic of the web page. It is all (mostly) client side logic. It doesn't let you access the peripherals, or the file system. It just lets you access the browser display. Like CSS, you can run javascript either in-line, or embedded into the main file, or linked in an external file. Even though it's somewhat limited, there is still some pretty cool stuff you can do. I look forward to learning more about it in the next few weeks."},
{"date":"06/23/2015", "title":"Javascript Day 2", "text":"Objects and Functions:<br>------------------<br>So, 15+ years ago when I was first introduced to Javascript, it felt like it wasn't a real programming language. It was just something to tweak and add a little functionality to the HTML. Today, Javascript feels like a real language. I'm not sure how deep it can go, but it really is almost on-par with Python in terms of funcionality. from what I've seen, the few things it doesn't do out of the box is accessing things like file storage (obviously), and to seems like python has better user interface in terms of graphics, keyboard inputs, etc.<br><br>We also introduce real for-loops, boolean tertiary statements, date functions. My problem going forward is going to be remembering semi-colons after each line."},
{"date":"06/24/2015", "title":"Javascript Day 3", "text":"Javascript Forms:<br>------------------<br>Javascript has the same forms that they had 10 years ago, (text boxes, buttons, etc), but jQuery added a ton of functionality like the ability to recognize clicks on things other than buttons (example: hide a div when you just click on the raw text within it). jQuery also makes it easier to acess the objects on the page with .text .val(). It doesn't need to be just a text box. You can create and display HTML, forms, buttons, anything on the fly."},
{"date":"06/25/2015", "title":"Javascript Day 4", "text":"Updating the Blog:<br>------------------<br>Today we are updating our blog to add a lot of new functionality. The things we need to add is a way to read out blogs from the JSON file into our homepage and display it. jQueries .getJSON() function runs asynchronously, so you have to accomodate for this. If you need to use the data at anypoint (ie. to display our blog) you need to wait for the read to finish, because otherwise your javascript will just keep running without realizing it hasn't been read yet. You could just use a timeout timer, but to do it properly you should wait for the JSON.complete flag, as a trigger for other events.<br><br>In addition to reading the blog, we need to split it (the instructors are calling it pagination?) into sections of 5 pages. Finally, we need to be able to search through all the blogs and display only the blogs that match our search field. In addition we need to add some animations to hide the main homepage when we start searching, and only show our search results."},
{"date":"06/26/2015", "title":"Javascript Day 5", "text":"SUCCESS!!:<br>------------------<br>Finally, got the all the search functionallity and hide-show requirements in the Lab. It actually looks really cool, and responds really well. It is amazing how far HTML/Javascript advanced in the past 10 years. What used to require Adobe Flash can now be done in basic HTML5, CSS, and jquery, out of the box, for free. I am literally speachless."},
{"date":"06/29/2015", "title":"Image Test", "text":"This is a test to see how much HTML code can be dumped into the blog. This first test is of an image file.<br><br><img src=\"assets/img/devcodecamp.png\" alt=\"devcodecamp\">"},
{"date":"06/29/2015", "title":"Link Test", "text":"This is a test to see how much HTML code can be dumped in. This second test is to see if I can add a link to the image<br><br><a href=\"http://www.devcodecamp.com\" target=\"_blank\"><img src=\"assets/img/devcodecamp.png\" alt=\"devcodecamp\"></a>"},
{"date":"06/29/2015", "title":"Javascript Group Project", "text":"Fixed the Generator:<br>With a few tweaks to allow for escape characters, carriage returns, etc, the code seems to be working really well. I even have it compensating for additional HTML, like images and links. (you might have seen my previous posts today). All in all, I'm pretty pleased that I was able to decipher the instructors code, fix it, and add additional functionality to it.<br><br>New Group Project:<br>So we have a new group project. It is a survey generator. Meaning, it is a tool for an administrator to quickly build a survey from a list of modules (ie. check box questions, text box questions, pass-word, slider, all sorts of form objects). From there, he can fill out additional information like the text of the question, any images he wants, values for the radio buttons etc.<br><br>From there, they can generate emails to send out to people with a custom hash, so that no one can fill it out more than once.<br><br>Obviously, people can then take the survey. Afterwards, the administrator can review the results with a results page, and select between individual surveys and collated groups, or switch between several different survey batches.<br><br>Also, I volunteered as project lead for this project. Hopefully it all goes well. "},
{"date":"06/30/2015", "title":"Javascript Group Project", "text":"Today was a difficult day. We had an awesome start on the new group project. The guys running the front end have a really awesome start going. I think my achritecture of the design is going to work really well, and so far it's let them be super modular and independent. No file conflicts so far. No ones duplicating work. My afternoon however has been a massive struggle with Dave's Web host. We are not sure why but it's just not working. It works for straight Python, but when you try to get it working with Javascript it's full of Cross-Origina Conflict errors. We've tried a lot of tricks we found online, with Chrome and firefox add-ins, proxy servers, etc. In the end, nothing has worked. Dave is going to stay late tonight with my test functions and his server, and try to figure it out. Hopefully tomorrow moring, we'll have it worked out."},
{"date":"07/1/2015", "title":"AJAX is a pain", "text":"FRUSTRATION! I suppose it's not really ajax's fault. It's more of a cross-origin conflict, than AJAX itself. Dave was able to work out something overnight, but he had to redesign his FLASK web host. It works, sort of, it's just been a lot of tweaking all day."},
{"date":"07/2/2015", "title":"Group Project work", "text":"Added some additional functionality and worked with Rob on the back-end. He is trying to work on the administrator login and struggling. I am not having much luck either. We are looking at cookies, but I'm not really sure that's the best method to go. We found a javascript library to create cookies and read them, but it seems like it would be super easy to hack (at least for the library we were looking at). It seemed like it was just a key-value pair. So it seems like it would be super easy to copy. Maybe I'm wrong. Instead the only thing we could come up with is to repeatedly query the server-side to authenticate. Maybe something else will come up over the weekend. We'll only have about 4 hours on monday before we need to present."},
{"date":"07/6/2015", "title":"Group Project Presentation", "text":"Today, we presented our group project. It turned out OK. I was a little disappointed in it to be honest. We were so close and couldn't quite tie the final knots together. The instructors said we did great work (I think they overloaded us on purpose to try to push our limits), but again... Sooo Close to an actual project. We had the survey build portion down pat. No problems there. We had some minor tweaking to do on the End-user survey reader. In my opinion, for a minimum viable product, we need to finish the Administrator authentication, and add the administrator review page.<br><br>That being said, the parts we did have looked really good in the end. I'd like to add a little more functionality on my own, before I'd consider it \"presentable\" as a portfolio worthy piece. Clean up some of the code and such, but it's not bad. Speaking of portfolio, I need to find time to clean up some of my older projects as well. Asteroids and such. They have us running so fast, there's no chance to backtrack yet. Maybe this weekend, if I don't have homework."},
{"date":"07/7/2015", "title":"C#", "text":"Today is the start of C#, I am really enthused for this. It's not that Javascript and Python weren't fun (they really were honestly), but this is the reason I came to devCodeCamp. I hear the demand for C# programmers is pretty high in the Milwaukee area. Don't get me wrong, if I was offered a job in either Python or Javascript, I'd jump at the opportunity, but I have a feeling there are more opportunities out there in the C#/business world.<br><br>We started off the day with some real good lectures about C# organization and objected oriented programming.<br><br>Specifically, I had seen DLL's, EXE's, classes and namespaces before but, for example, I never REALLY understood what a namespace was, and what their full scope was. Like when did you need to use a \"using\" call, and when could you just let the namespace scope take control. I've never seen a good explanation what it was in any tutorials, but now it makes total sense.<br><br>We also got some information on the S.O.L.I.D. programming paradigm.<br>- Single Responsibility - do one thing, and do it well<br>- Open/Closed principal - keep your classes open for extension, but closed to modification<br>- Liskov Substitution principal - Any child should be able to fill in for a parent class, without causing a breakdown<br>- Interface Segregation - since you can inherit multiple interfaces, keep them tight and specific, don't use a single all-encompassing interface, that future users might not need.<br>- Dependency Inversion Principal - Design for the big-picture, not the specific details. (ie. if you are making a calculator, don't design for 2+2 = 4, design for the big picture, sum(1,2,3,4,5,6... etc.)<br><br>"},
{"date":"07/8/2015", "title":"C# Robot Projects and Calculators", "text":"Robot Project:<br>- - - - - - - - - - - <br>We presented our final robot projects today. I did really well. I covered all the topics we discussed the other day (interfaces, abstract classes, inheritance in c#, etc.) I have a total of 4 robots (Roomba, BigDog, Flex, and MegaFlex) that each have their own set of commands the can respond to, in addition to commands that they inherit from the base robot class. I really like how it turned out. I also used the base functions and base constructors we discussed.<br><br>On a side Note:<br>Ben suggested I look into the Dependency Injection and Factory Constructor design patterns. That would allow me to create expandable control responses without having to hard-code responses within the robot class itself. It would be the equivalent of passing in a control module to the robot. And you could swap that control module out, depending upon what you wanted that robot to do... It's a fascinating abstract idea to think about. I'm not sure I have my mind around it just yet, but I like where it's leading. It's like extracting the brain/logic, and making it available to be customized at run-time as a pass-in parameter.<br><br>Lectures:<br>- - - - - - - -<br>Today's we had 3 advanced lectures about:<br>- UML (Unified Modeling Language) (specifically class diagrams, use-case diagrams, and sequence diagrams)<br>- Testing (from smoke test, to unit test, to white/black box testing, to integration testing, to regression testing, and end-to-end testing)<br>- Complex C# constructs (mutability and passing by reference vs. value, Exceptions, Generics, and Attributes)<br><br><br>Calculator Project:<br>- - - - - - - - - - - - - - <br>We have a new project. We have to design a command line calculator that will take a string, and do the math required. We are to do it in an extensible way, that if we add new operators, it will be simple to add them without breaking the code. We have until Friday.<br>"},
{"date":"07/9/2015", "title":"C# Calculator Project", "text":"Today we had lectures on basic C# structures. Arrays, enumerators, lists, iterators, and accessor functions.<br><br>We also continued work on our calculator. I am struggling with an order of operations parser, so I am taking a step back, and simplifying with a the most basic calculator. Two values, and an operator.<br><br>Ben's optional challenge of Dependency Injection seems a bit out of place in this project, but maybe not. I used it to break out the core logic of the calculator. I can't imagine a scenario where someone would want to make addition and subtraction mean something different, with respect to a calculator, but maybe there is something there. In either case, by injecting the logic as a pass-in, you can change it at run-time if you like."},
{"date":"07/10/2015", "title":"C# Testing", "text":"I feel good about the C# test. Not 100 percent confident on the white board portion of it, but otherwise it felt good. I did have a major success today as well with my order of operations parser! Using recussion (and sort of a reverse order of operations technique) I was able to break up the equation into smaller and smaller chunks until it was just the values, and an operator. Then it collapsed the binary tree back, doing all the appropriate calculations that it parsed in. It worked like a charm. I am super impressed with it. Normally I hate recursion, but this one turned out really well."},
{"date":"07/13/2015", "title":"C# Calculator presentation, new project", "text":"Today we presented our calculator projects. Did well. As I mentioned Friday I finally got my parser working. Two things I realized is that I don't have any divide by Zero checks. That's an unfortunate oversight on my part. I do also have one know bug in my parser that I haven't ironed out yet. It cannot yet differentiate between a negative number, vs. a subtraction sign. In other words, it would crash if I tried 2 * -2. It would try to subtract 2 from the multiplication sign and fail.<br><br>Our new project is a one-day sprint at refactoring our old Lemonade stand project, redone in C#, instead of Python.<br><br>It was not a success, but we were pretty close. A lot of good functionality, but the integration of the small pieces together into one big thing is where we are sticking. It was close, just not enough time in one day."},
{"date":"07/14/2015", "title":"Second New Project - Vending Machine Company", "text":"today we start a second new project, based on a real world situation. We are to design inventory control software for a vending machine company to track stock, sales, and service for different vending machines, at different locations, and potentially different cities.<br><br>I am taking on the back-end data modeling portion, faking together a database, with dummy data, since we won't be using a live database for the project.<br><br>According to the instructers we've accidentally fallen into an MVC like pattern, where our group members are dividing the tasks up into front-half, back-half, control type of tasks. I think that's a compliment. We did it accidentally, just based of our initial white-board designing, so I think that means we created a pretty good design.<br><br>We will get bonus points (if we finish early), if we can design some additional functionality like something to do optimize route planning for restock/service calls."},
{"date":"07/15/2015", "title":"Vending Machine Company Project", "text":"Project is looking good. We reached all our tasks today. Fake database is fully functioning.<br><br>We did have one set-back, we rearranged how we were handling the accounting. Rather than the product itself handling the purchase/sale price we reconfigured it similar to a real accounting system with double-entry notation. I had to redo my transaction entries to accommodate.<br><br>Additionally, I moved to some of the Controller aspects of the MVC pattern. I started adding functionality with a transfer stock class, that will take the amount of candy bars to transfer, pull them from stock, move them to the machine, and generate the transaction automatically."},
{"date":"07/16/2015", "title":"Vending Machine Project", "text":"Very close to our goal today. We have everything except the stock transfer page, and individual update pages.<br><br>Reports are going really well, Matt's working on the PDF export. Every page has it's Add/Remove Functionality working.<br><br>My Goals for tomorrow are the Machine Restock page, The machine Sales page, and the warehouse stock dump. If I have time, I'd like to be able to add update pages for the remaining classes/objects/pages."},
{"date":"07/17/2015", "title":"Vending Machine Project", "text":"Looks amazing considering only 3.5 days of work. Matt did awesome on the page layout. Ryan did awesome on the reports today. I got a pretty cool product transfer page running. Altogether, I would say it was a fantastic success. <br><br>Obviously, there are things that can be improved. I already have some ideas on how I want to refactor some of the code, but for a first run, working product, it's pretty damn good.<br><br>Of everything we made, I think this, Chomp Survey, and Asteroids are the most worthy of being portfolio pieces. One of these days I'm going to have to buy my own domain name."},
{"date":"07/24/2015", "title":"Project Summary: Design Patterns - Phone News Subscription Notifier", "text":"This is the port-mortem on our personal projects involving design patterns.<br><br>The project involves using 4 design patterns to accomplish specific task. The overarching theme is that we run a server that phones subscribe to. They subscribe to different news feeds on that server. When new content is added to that news-feed, each phone that is subscribed to the news feed will get a notification pushed to its individual phone.<br><br>There are a couple of different objects and abstract classes that do most of the work. The phone and server themselves. Inside the server are lists containing phone records (including their subscriptions). It also contains a list of news feeds, which in-turn contain a list of articles.<br><br>Specific design patterns requested:<br>1. Decorator design pattern - <br>We were requested to specifically use the decorator design pattern for our subscription listings. It is not the way I would have originally done it, but it works out rather well. I can see it's advantage. Basically, as the phone subscribes to, lets say business news... The business news subscription decorator object gets wrapped around the existing onion of subscriptions. This makes it easy to pull news and notifications using recursion, rather than iterating through a list. The one disadvantage I see, is that unless you already knew it was a decorator, it might be difficult for someone to debug later. They might think it's a single object, without looking at the inner layers of the onion.<br><br>2. Factory design pattern - <br>In creating our subscription decorator onion, we were requested to use a factory pattern to choose, create, and apply which decorator to use, based on the inputs. Fairly straight forward.<br><br>3. Proxy design pattern -<br>When notifications are pushed, we are to use a proxy pattern for simplifying the connection to each phone. Since these are fake phones and fake news feeds, it's really just a single line piece of code for the proxy that passes on the information to the phone... but the concept is still there. Putting an outer wrapper around the class to simplify the complicated tasks, and just deal with the actual message or notification.<br> <br>4. Observer design pattern -<br>This is where the most interesting pattern comes into play. It is fairly basic in concept, but harder to implement in C# than I suspected. Their built-in interfaces were a little difficult to work with, but in the end I got it working. The concept is basically this: each news-feed has their own list of subscribers (kept and tracked separate from the individual phones subscriptions). Every time a notification is required, it iterates through this list, and triggers a common function on each subscription decorator (the onion). <br><br>Concept wise, really cool, and not that bad. Syntactically, get all the variable types implicitly cast to match the desired interface/class/variable declarations... a huge pain. BUT! I got it working, and I can do it again, now that I've done it once.<br><br>Completed 100%"},
{"date":"08/7/2015", "title":"MVC.Net and SalesForce Integration", "text":"Santa's little helper... Or as I like to call it, the evil Santa-bot.<br><br>This project was very open ended. The only requirements were that we had one week to create it, needed to be a website that uses ASP.NET MVC, and that it had to integrate with the Salesforce API in some fashion.<br><br>With Santa's little helper the concept is pretty evil... I can't believe I came up with it... I'll start from the beginning:<br>1. I am toy company XYZ.<br>2. I have a series of products that I sell.<br>3. The child goes to the Santa's little helper website which asks them a bunch of questions -- demographics like age, city, stat, country, etc. and what they want for Christmas.<br>4. It also asks for the parents email address to forward the child's responses to, so they have a record of what the child asked for.<br><br><br>The evil part:<br>1. Social Engineering - <br>If the child asks for a product that is similar to one I provide, it will ask the child if it would also like my product (ie. lets say I make Builder Blocks, and they ask for Lego's I might recommend builder blocks to the child, to entice them to buy my product instead.<br><br>In the email response to the parent, I will prioritize my products over the competitors. Since they did ask for Lego's I won't be super obvious about it, and I will still include their request, but prioritize it towards the bottom.<br><br><br>2. Mailing List -<br>Because they included their email address, I can now subscribe them to my mass marketing mailing list. Additionally, I can sell that email information to some other mass-mail company for a profit.<br><br>3. Demographics Information -<br>By compiling the data by age and area, I can sell that information to competitors or analysts (for a profit), to determine what the hot new toy is going to be this year. I can also sell that to my own mailing list of parents, to 'recommend that they get out and buy it now, before they are all gone!'<br><br>4. SalesForce Contact Information -<br>Every child that enters the site gets a Sales-Lead added to the SalesForce database. These leads can either got to my own salesman, or I can sell them to my competitors (again, and say it with me now... for a profit!)<br><br>God - I feel gross just thinking about how evil it is. I can't believe my brain came up with it. I hate everything about it, but I guess I'm good at it??<br><br><br>Marketing politics aside this project used quite a bit of interesting technology:<br>1. OAuth - Using the ASP.NET MVC framework it was amazingly simple to authenticate users via Google, Facebook, Twitter, etc. It did it almost all for you, with only some minor tweaking. <br><br>2. NuGet - Similar to Linux's Apt-Get or Python's PIP installer, NuGet is a Package Manager that lets you easily install additions to your project. As part of my project, I decided to only use SalesForce to authenticate, since I didn't want outside uses to be able to log into the analytics. Since SalesForce OAuth is not part of the standard ASP.NET MVC template, I had to get the OWin.Security.Providers package, that included the SalesForce OAuth provider.<br><br>3. SalesForce RESTful API - This is the main interface between my website and SalesForce. This also required a NuGet Package called DeveloperForce.Force (it is a collection of older SalesForce packages that used to be separate, like Developerforce.Web.Login, etc.., but are not in one convenient package). If you are using the DeveloperForce package, there is also a handy package that gives you an example of how it can be used, called DeveloperForce.Web.Samples.Accounts. With this, you should easily be able to figure out how to pull data from SalesForce.<br><br>4. SalesForce itself - I've used SalesForce before in previous jobs, but this was the first time I've ever tried to set-up a new company in it. If you have never used SalesForce before, it can be daunting, but I highly recommend taking a look at it, at least from the Developer side of it. It is very powerful, very big, and very flexible. (It's also very expensive)<br><br>5. Razor Language - It is a mark-up language similar to HTML. In this case, MVC uses it to help you bind data from your model to your view. W3Schools has some decent tutorials on it, although I didn't use it much beyond databinding and form controls.<br><br>6. MVC (General design pattern) - Separate from the .NET framework, MVC (short for Model-View-Control) is a design pattern that separates the data storage (databases, and class objects) from the control logic (navigation, data binding, data filtering), from the View (formatting and page layout). It makes it really handy to work as a group, because you can divide tasks and files between peoples core responsibilities and strengths.<br><br>7. ASP.Net MVC Framework - This is a very cool framework Visual studio, it makes dividing out the Models, Views and Controllers relatively straight forward and obvious. Views can be HTML, Javascript, CSHTML, any of your standard web file types. Controllers are specific classes in C# that end in Controller. Your standard object classes C# that you are used to become your data models. <br><br>One key point I should mention is that all webpage calls are routed first through the controllers, before displaying the webpage (or at least they should, by the MVC standard). So, the process when you browse to www.somewebsite.com - that web-call is first routed through the home controller. If there is any pre-processing you want to do, you do it there in the controller, and as the last thing, you show the index.html page... that is a MASSIVE oversimplification, but the key point is that the controller itself determines which page gets shown. If you don't want to show index.html, but instead want to do a POST to a database, or jump to a completely different website, you can... the navigation is all determined by the controller.<br><br>8. Entity Framework - While not part of this project directly (ie. we weren't asked to use it specifically) it can be a core feature of ASP.Net MVC. I wanted to mention it here because we used it without even realizing it. If you store any data in a database (similar to what we are doing with our main page, that stores the child's survey results, Entity framework is what pushes the information into the database, and recalls it later for the analysis. As an oversimplification, you can think of it as a way to simplify SQL calls, and bind data from the database to your application logic in a neat, clean, concise, way. It takes the nuts-and-bolts of SQL out of your hands, packages it together, and lets you drive the car instead.<br><br><br>Future iterations:<br>In the week that I had to do this, there were a few parts that got left on the chopping block, that I might like to flush out eventually.<br>1. I did not have time to flush out my filtering and analytics section. I have simple graphs of record counts by city,state, etc. but I would really like to see a graph of product count, by child age.<br><br>2. I did not have time to start the Product Recommendation logic. I would really like to do a little machine learning or pattern recognition to figure out which of my products best matches the child's wishes. I think it's fascinating, but these concepts weren't part of the original project requirements, so they had to take a lower priority.<br><br>3. I would have liked to delve deeper into the OAuth, and add user profiles and privileges. Right now, every user can view every page, once they login. I might like to restrict some of the admin pages to only managers, and only allow the salesmen into analytics, and customer contact pages."},
{"date":"08/7/2015", "title":"SQL, and Linq", "text":"Our project this week is to reinforce SQL and learn Higher order functions (Linq, lambda expressions, functional programming, etc)<br><br>The first project was to create a Microsoft SQL server database, based off a design diagram. The second project was, given a comma separated file (CSV file) of polling data, from several polls, across several weeks, take the data, parse it down using linq, and predict who the winner is going to be.<br><br>Technologies used:<br>1. SSMS (SQL Server Management Studio) - this is the main tool we used in building our database. Using standard SQL syntax (without using the prebuilt tools), you can create tables, add and modify primary and foreign keys, select and filter data... basically do all your standard CRUD operations from a scripting interface. You can even save your scripts as a way to version control database changes. If you run each script in order, you can have your customer update their database to match your development environment. These scripts you can even put into git-hub, which you can't do with a full database.<br><br>2. C# Higher Order Functions (Dynamic coding) - We had a few small projects using higher order functions. <br>One was simply a test, to see if could research and figure out how to pass a function (using the FUNC property type) into a second function, and then invoke it on a data set that was also passed it. The syntax was confusing at first, but after more research, it made total sense. The key was that you have to include not only the datatype of what it takes in, but what it returns, as a second parameter. Also, don't include the () when passing in the function from the main program.<br><br>The second part was learning to use linq statements.<br>Mapping functions like .SELECT() will perform an operation on every item in the data structure and return a copy, or completely new operation.<br>Filtering functions like .WHERE() will filter out records you don't want to perform those operations on.<br>Zipping functions like .ZIP() will take in two lists and combine them into a single list. This can be simple concatination of the values, or any programmatic way of merging them that you want to code.<br><br>(* disclaimer: I wish I could include some code in this blog post, but the website likes to try to interpret special characters as HTML codes. However, there are some really good examples out there at http://linq101.nilzorblog.com/linq101-lambda.php, if you are interested in more)."},
{"date":"08/19/2015", "title":"Portfolio Website", "text":"For the portfolio website we went with ASP.NET MVC. In this particular case I took on the role of front-end developer to expand my skills in that area. I consider it one of my weaker points and wanted to get more experience in it.<br><br>For the front-end, I decided to go with a mobile-first approach, so I started out right away using Bootstrap, to be responsive, and re-size things appropriately as the screen size shrinks. I also made the navigation all left-right swiping, similar to what you might see on a phone. To do the carousel, also used a java-script library called slick-slider. It had a lot of nice features I liked, like built in responsive design, and the ability to add and remove carousel tiles on the fly.<br><br>I also had a hand in some of the controller work, specifically in creating new Entity Framework records, inserting them into the SQL tables. Updating records, deleting records, all using the Entity Framework ORM methods to handle the database.<br><br>Matt and Ryan handled a lot of the back-end on this project for a change, building the tables in Microsoft SQL server on the Azure web hosting site. They also handled the image and pdf blob manipulations and cloud storage. Finally, Ryan did some excellent work on the security and login side of things, using Microsoft Identity and the built-in Authentication and Authorization tools.<br><br>-- -- -- -- --<br>At the end of this project, we also had to give two presentations to real companies. One was Bright Cellars out of the Ward4 building downtown, and one was Generator, a start-up generator company based out of the same building. Both companies said our presentation and our product was excellent, and not just at a student level, but in general at developer to developer level. Generator even gave of a few tips on how to improve the product for future revisions."}
]}